PokePortal/app/controllers/application_controller.rb

  def find_user_from_token
    token = request.headers['Authorization'].to_s.split(' ').last
    user_id = decode_jwt(token)
    puts user_id
    User.find_by(id: user_id) if user_id
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]