PokePortal/app/controllers/battles_controller.rb

  def create
    battle = current_user.battles.new(battle_params)
    if battle.save
---
INSERT INTO "battles" ("title", "description", "date", "user_id", "created_at", "updated_at", "battle_type") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    #Find the battle based on the request
    battle = Battle.find_by(id: params[:id])

    #update the battle with the provided params (success vs failure cases)
    if battle.update(battle_params)
---
SELECT "battles".* FROM "battles" WHERE "battles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "battles" SET "title" = $1, "description" = $2, "date" = $3, "updated_at" = $4, "battle_type" = $5 WHERE "battles"."id" = $6  [["title", "TEST"], ["description", "TEST"], ["date", nil], ["updated_at", "2023-12-07 16:39:46.739775"], ["battle_type", "DOUBLES"], ["id", 3]]

  def destroy
    battle = current_user.battles.find_by(id: params[:id])
    if battle
      if battle.destroy
---
SELECT "battles".* FROM "battles" WHERE "battles"."user_id" = $1  [["user_id", 2]]
DELETE FROM "battles" WHERE "battles"."id" = $1  [["id", 1]]