PokePortal/app/controllers/comment_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Anonymous"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hello there!"], ["user_id", 6], ["post_id", 7], ["created_at", "2023-12-08 00:22:24.906010"], ["updated_at", "2023-12-08 00:22:24.906010"]]
---
    def create
      if not current_user
        anonymous_user = User.find_by(username: 'Anonymous')
        comment = anonymous_user.comments.new(comment_params)
      else
        comment = current_user.comments.new(comment_params)
      end
      post = Post.find_by(id: params[:post_id])
      comment.post = post
      if comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]
---
    def index
        post = Post.find_by(id: params[:id])
        puts post
        if post.save
          comments = post.comments.all