PokePortal/app/controllers/post_controller.rb

SELECT "forums".* FROM "forums" WHERE "forums"."title" = $1 LIMIT $2  [["title", "competitive"], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "user_id", "forum_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        forum = Forum.find_by(title: params[:forum])
        post = current_user.posts.new(post_params)
        post.forum = forum
        if post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        post = Post.find_by(id: params[:id])

SELECT "forums".* FROM "forums" WHERE "forums"."title" = $1 LIMIT $2  [["title", "news"], ["LIMIT", 1]]
---
    def index_by_forum
      forum = Forum.find_by(title: params[:tag])

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 5]]
---
  def destroy
    #find the post that belongs to the current user by ID
    post = current_user.posts.find_by(id: params[:id])