PokePortal/app/controllers/user_controller.rb

  def login
    user = User.find_by(username: user_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "flolily"], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest", "bio", "profile_pic") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "flolily"], ["created_at", "2023-12-03 04:20:56.964564"], ["updated_at", "2023-12-03 04:20:56.964564"], ["password_digest", "[FILTERED]"], ["bio", nil], ["profile_pic", nil]]

  def find_user(request)
    authorization_token = request.headers['Authorization'].split(' ').last
    id = decode_jwt(authorization_token)

    return User.find_by(id: id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]