project-3/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
        @post = Post.find(params[:post_id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "rfdfdgd"], ["body", "fsfsfsgrgdd"], ["post_id", 1], ["created_at", "2023-11-06 17:15:00.072168"], ["updated_at", "2023-11-06 17:15:00.072168"]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.build(comment_params)
        if @comment.save