project-3/app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def new
        # important to ensure @user in _form is not nil
        @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["body", "fsdfskfsfdsfs"], ["user_id", 1], ["created_at", "2023-11-06 17:14:46.605896"], ["updated_at", "2023-11-06 17:14:46.605896"], ["title", "fsfsfs"]]
---
    def create
        @user = User.find(params[:user_id])
        @post = @user.posts.build(post_params)
        if @post.save