project-3/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["username", "sdsfs"], ["email", "fdsfsf"], ["created_at", "2023-11-06 17:13:54.888649"], ["updated_at", "2023-11-06 17:13:54.888649"]]

    def update
        @user = User.find(params[:id])

        if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "fdsfs"], ["updated_at", "2023-11-06 17:13:59.793876"], ["id", 1]]